app/views/items/new.html.haml

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` BETWEEN 1 AND 3)
---
                      .form-group__input#parent
                        = f.collection_select :category_large_id, Category.where(id: 1..12), :id, :name, {include_blank: "---"},{class: "category-large"}